
# tap repositories and their packages

tap 'homebrew/core'
brew 'adns'
brew 'anyenv'
brew 'autoconf'
brew 'automake'
brew 'aws-shell'
brew 'bdw-gc'
brew 'bison'
brew 'cmake'
brew 'colordiff'
brew 'ctags'
brew 'diff-so-fancy'
brew 'direnv'
brew 'emacs'
brew 'fd'
brew 'fontconfig'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'gist'
brew 'git'
brew 'git-flow-avh'
brew 'gitleaks'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gperftools'
brew 'graphviz'
brew 'gts'
brew 'htop'
brew 'hub'
brew 'icu4c'
brew 'imagemagick@6'
brew 'isl'
brew 'jasper'
brew 'jpeg'
brew 'jq'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libiconv'
brew 'libidn2'
brew 'libksba'
brew 'libmagic'
brew 'libmpc'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libxml2'
brew 'libxslt'
brew 'little-cms2'
brew 'mas'
brew 'mpfr'
brew 'mycli'
brew 'mysql'
brew 'mysql@5.6'
brew 'mysql@5.7'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'nginx'
brew 'nkf'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'oniguruma'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'paperkey'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pkg-config'
brew 'protobuf'
brew 'protobuf@3.7'
brew 'python'
brew 'python@3.8'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'sqlite'
brew 'sslscan'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unar'
brew 'unbound'
brew 'utf8proc'
brew 'w3m'
brew 'webp'
brew 'xz'
brew 'yarn'
brew 'zlib'
brew 'zplug'
brew 'zsh'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'alacritty'
cask 'anaconda'
cask 'docker'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'jasper'
cask 'keepassxc'
cask 'sequel-pro'
cask 'virtualbox'
cask 'visual-studio-code'

tap 'argon/mas'

tap 'aws/tap'
brew 'aws-sam-cli'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'tkengo/highway'
brew 'highway'

tap 'z80oolong/tmux'
brew 'tmux-libevent@2.2'

# Other Homebrew packages
brew 'doxygen@1.8'
brew 'libevent@2.2'

# App Store applications
mas 'GarageBand (10.3.4)', id: 682658836
mas 'iMovie (10.1.14)', id: 408981434
mas 'Keynote (9.2.1)', id: 409183694
mas 'LadioCast (000013000)', id: 411213048
mas 'Numbers (6.2.1)', id: 409203825
mas 'Pages (8.2.1)', id: 409201541
mas 'Slack (4.4.0)', id: 803453959
mas 'Xcode (11.3.1)', id: 497799835
